In [9]:
import pandas as pd
df=pd.read_csv('/content/employee_data_3500.csv')
df

,EmployeeID,Name,Department,Age,Salary,City,Gender
0,100001,Priya Patel,Operations,23.0,733224.0,Hyderabad,Other
1,100002,Sneha Jain,IT,57.0,1437765.0,Pune,Female
2,100003,Neha Agarwal,IT,46.0,1034670.0,Delhi,Female
3,100004,Rahul Banerjee,Operations,42.0,1452103.0,Bangalore,Male
4,100005,Arjun Iyer,Finance,48.0,967911.0,Mumbai,Male
...,...,...,...,...,...,...,...
3495,103496,Varun Rao,Operations,21.0,1053072.0,Chennai,Other
3496,103497,Meena Bansal,Finance,60.0,472844.0,Delhi,Male
3497,103498,Divya Chatterjee,HR,56.0,917648.0,Bangalore,Other
3498,103499,Isha Rao,Operations,53.0,1352277.0,Mumbai,Female
3499,103500,Meena Kumar,Marketing,27.0,1375400.0,Chennai,Other

In [10]:
df.to_excel('emp.xlsx', index=False)

In [11]:
df[df['Age']> 40]

,EmployeeID,Name,Department,Age,Salary,City,Gender
1,100002,Sneha Jain,IT,57.0,1437765.0,Pune,Female
2,100003,Neha Agarwal,IT,46.0,1034670.0,Delhi,Female
3,100004,Rahul Banerjee,Operations,42.0,1452103.0,Bangalore,Male
4,100005,Arjun Iyer,Finance,48.0,967911.0,Mumbai,Male
11,100012,Meena Reddy,Operations,54.0,659189.0,Mumbai,Other
...,...,...,...,...,...,...,...
3487,103488,Rahul Reddy,Operations,41.0,1101889.0,Delhi,Male
3488,103489,Isha Rao,Marketing,49.0,351837.0,Hyderabad,Other
3496,103497,Meena Bansal,Finance,60.0,472844.0,Delhi,Male
3497,103498,Divya Chatterjee,HR,56.0,917648.0,Bangalore,Other
3498,103499,Isha Rao,Operations,53.0,1352277.0,Mumbai,Female

In [12]:
df.sort_values(by='Salary', ascending=False)

,EmployeeID,Name,Department,Age,Salary,City,Gender
2560,102561,Meena Das,Operations,50.0,1799882.0,Mumbai,Female
2451,102452,Shreya Gupta,Sales,26.0,1799881.0,Mumbai,Other
2689,102690,Amit Ghosh,Sales,43.0,1799158.0,Delhi,Male
2679,102680,Preeti Gupta,Finance,52.0,1798723.0,Mumbai,Male
2693,102694,Ritu Iyer,IT,59.0,1798102.0,Hyderabad,Male
...,...,...,...,...,...,...,...
825,100826,Abhishek Rao,Operations,49.0,NaN,NaN,Other
830,100831,Suresh Khanna,Marketing,45.0,NaN,NaN,NaN
831,100832,Vikram Ghosh,IT,43.0,NaN,Chennai,Female
832,100833,Divya Khanna,Finance,55.0,NaN,Mumbai,NaN
2500,102501,Kiran Malhotra,Sales,NaN,NaN,Chennai,NaN

In [13]:
df.sort_values(by=["Salary", "Name"], ascending=[False, True])

,EmployeeID,Name,Department,Age,Salary,City,Gender
2560,102561,Meena Das,Operations,50.0,1799882.0,Mumbai,Female
2451,102452,Shreya Gupta,Sales,26.0,1799881.0,Mumbai,Other
2689,102690,Amit Ghosh,Sales,43.0,1799158.0,Delhi,Male
2679,102680,Preeti Gupta,Finance,52.0,1798723.0,Mumbai,Male
2693,102694,Ritu Iyer,IT,59.0,1798102.0,Hyderabad,Male
...,...,...,...,...,...,...,...
832,100833,Divya Khanna,Finance,55.0,NaN,Mumbai,NaN
2500,102501,Kiran Malhotra,Sales,NaN,NaN,Chennai,NaN
830,100831,Suresh Khanna,Marketing,45.0,NaN,NaN,NaN
831,100832,Vikram Ghosh,IT,43.0,NaN,Chennai,Female
804,100805,NaN,Operations,NaN,NaN,Pune,Female

In [14]:
df.groupby('Department').count()

            EmployeeID  Name  Age  Salary  City  Gender
Department
Finance            591   591  591     590   591     590
HR                 558   558  558     558   557     557
IT                 553   553  552     552   553     553
Marketing          588   588  588     587   587     587
Operations         608   607  606     606   606     608
Sales              601   601  600     600   601     600

In [15]:
df.head(50)

,EmployeeID,Name,Department,Age,Salary,City,Gender
0,100001,Priya Patel,Operations,23.0,733224.0,Hyderabad,Other
1,100002,Sneha Jain,IT,57.0,1437765.0,Pune,Female
2,100003,Neha Agarwal,IT,46.0,1034670.0,Delhi,Female
3,100004,Rahul Banerjee,Operations,42.0,1452103.0,Bangalore,Male
4,100005,Arjun Iyer,Finance,48.0,967911.0,Mumbai,Male
5,100006,Ramesh Singh,HR,27.0,868437.0,Delhi,Female
6,100007,Nitin Kumar,HR,21.0,596866.0,Delhi,Other
7,100008,Prakash Chatterjee,HR,27.0,1777136.0,Delhi,Other
8,100009,Prakash Banerjee,Operations,37.0,894055.0,Bangalore,Male
9,100010,Karan Iyer,IT,35.0,1503939.0,Delhi,Female
10,100011,Neha Singh,Operations,NaN,813435.0,Hyderabad,Other
11,100012,Meena Reddy,Operations,54.0,659189.0,Mumbai,Other
12,100013,Neha Chatterjee,Marketing,56.0,449407.0,Bangalore,Female
13,100014,Ritu Banerjee,IT,58.0,953006.0,Mumbai,Other
14,100015,Ramesh Agarwal,Marketing,57.0,1586105.0,Pune,Male
15,100016,Ritu Rao,Sales,35.0,1010386.0,Bangalore,Male
16,100017,Anjali Malhotra,IT,49.0,1433672.0,Bangalore,Other
17,100018,Ajay Gupta,IT,44.0,1230396.0,Bangalore,Male
18,100019,Manoj Mukherjee,IT,46.0,406380.0,Pune,Female
19,100020,Vikram Das,HR,50.0,572784.0,Pune,Other
20,100021,Ritu Sharma,HR,58.0,360802.0,Bangalore,Other
21,100022,Alka Verma,Marketing,53.0,1287204.0,Mumbai,Other
22,100023,Radhika Verma,Marketing,30.0,1716617.0,Pune,Female
23,100024,Sanjay Singh,IT,43.0,405813.0,Hyderabad,Female
24,100025,Priya Sharma,Marketing,22.0,522144.0,Mumbai,Other
25,100026,Swati Sharma,HR,51.0,1104466.0,Pune,Male
26,100027,Amit Iyer,Operations,27.0,412826.0,Pune,Female
27,100028,Prakash Bansal,Operations,39.0,480605.0,Hyderabad,Other
28,100029,Rahul Kumar,Operations,47.0,1194363.0,Bangalore,Female
29,100030,Kiran Reddy,Marketing,26.0,1121909.0,Delhi,Female
30,100031,Suresh Agarwal,Sales,28.0,675354.0,Bangalore,Male
31,100032,Anjali Jain,HR,30.0,1777816.0,Bangalore,Other
32,100033,Isha Agarwal,Sales,43.0,1550157.0,Bangalore,Female
33,100034,Divya Patel,Marketing,40.0,1543099.0,Chennai,Female
34,100035,Ajay Singh,Finance,42.0,1620095.0,Chennai,Female
35,100036,Deepak Jain,IT,50.0,1747296.0,Hyderabad,Other
36,100037,Sanjay Kumar,HR,34.0,1766675.0,Pune,Other
37,100038,Neha Mukherjee,Operations,54.0,1234986.0,Delhi,Male
38,100039,Neha Das,Sales,51.0,1592506.0,Chennai,Other
39,100040,Deepak Mukherjee,Finance,43.0,1045798.0,Pune,Other
40,100041,Rahul Jain,Finance,51.0,955235.0,Hyderabad,Other
41,100042,Rohit Ghosh,HR,27.0,996950.0,Mumbai,Other
42,100043,Arjun Bansal,HR,49.0,715544.0,Chennai,Other
43,100044,Nisha Singh,Finance,49.0,1795056.0,Mumbai,Female
44,100045,Ajay Agarwal,IT,41.0,1706916.0,Mumbai,Male
45,100046,Jyoti Das,IT,25.0,1418798.0,Pune,Other
46,100047,Priya Singh,Sales,40.0,464722.0,Pune,Female
47,100048,Isha Patel,IT,23.0,1276633.0,Mumbai,Other
48,100049,Alka Mehta,Finance,28.0,1490740.0,Chennai,Other
49,100050,Preeti Iyer,Finance,22.0,576394.0,Mumbai,Female

In [16]:
df.shape

(3500, 7)

In [17]:
df.isnull()
df.isnull().sum()

EmployeeID    0
Name          1
Department    1
Age           4
Salary        6
City          4
Gender        4
dtype: int64

In [18]:
df.dropna()

,EmployeeID,Name,Department,Age,Salary,City,Gender
0,100001,Priya Patel,Operations,23.0,733224.0,Hyderabad,Other
1,100002,Sneha Jain,IT,57.0,1437765.0,Pune,Female
2,100003,Neha Agarwal,IT,46.0,1034670.0,Delhi,Female
3,100004,Rahul Banerjee,Operations,42.0,1452103.0,Bangalore,Male
4,100005,Arjun Iyer,Finance,48.0,967911.0,Mumbai,Male
...,...,...,...,...,...,...,...
3495,103496,Varun Rao,Operations,21.0,1053072.0,Chennai,Other
3496,103497,Meena Bansal,Finance,60.0,472844.0,Delhi,Male
3497,103498,Divya Chatterjee,HR,56.0,917648.0,Bangalore,Other
3498,103499,Isha Rao,Operations,53.0,1352277.0,Mumbai,Female
3499,103500,Meena Kumar,Marketing,27.0,1375400.0,Chennai,Other

In [30]:
df.fillna({"Salary": 1000000}, inplace=False)

,EmployeeID,Name,Department,Age,Salary,City,Gender
0,100001,Priya Patel,Operations,23.0,733224.0,Hyderabad,Other
1,100002,Sneha Jain,IT,57.0,1437765.0,Pune,Female
2,100003,Neha Agarwal,IT,46.0,1034670.0,Delhi,Female
3,100004,Rahul Banerjee,Operations,42.0,1452103.0,Bangalore,Male
4,100005,Arjun Iyer,Finance,48.0,967911.0,Mumbai,Male
...,...,...,...,...,...,...,...
3495,103496,Varun Rao,Operations,21.0,1053072.0,Chennai,Other
3496,103497,Meena Bansal,Finance,60.0,472844.0,Delhi,Male
3497,103498,Divya Chatterjee,HR,56.0,917648.0,Bangalore,Other
3498,103499,Isha Rao,Operations,53.0,1352277.0,Mumbai,Female
3499,103500,Meena Kumar,Marketing,27.0,1375400.0,Chennai,Other

In [20]:
df["Name"]

0            Priya Patel
1             Sneha Jain
2           Neha Agarwal
3         Rahul Banerjee
4             Arjun Iyer
              ...
3495           Varun Rao
3496        Meena Bansal
3497    Divya Chatterjee
3498            Isha Rao
3499         Meena Kumar
Name: Name, Length: 3500, dtype: object

In [21]:
data = {
    "EmployeeID": [101, 102, 103, 104, 105],
    "Name": ["Amit", "Neha", "Rahul", "Priya", "Karan"],
    "Department": ["IT", "HR", "IT", "Finance", "HR"],
    "Age": [25, 30, 35, 28, 40],
    "Salary": [45000, 55000, 60000, 52000, None]
}

df1 = pd.DataFrame(data)

In [22]:
df1.head(3)

   EmployeeID   Name Department  Age   Salary
0         101   Amit         IT   25  45000.0
1         102   Neha         HR   30  55000.0
2         103  Rahul         IT   35  60000.0

In [23]:
df1["Salary"].mean()

np.float64(53000.0)

In [24]:
df1[df1["Salary"] > 50000]

   EmployeeID   Name Department  Age   Salary
1         102   Neha         HR   30  55000.0
2         103  Rahul         IT   35  60000.0
3         104  Priya    Finance   28  52000.0

In [25]:
df1.sort_values(by="Age")

   EmployeeID   Name Department  Age   Salary
0         101   Amit         IT   25  45000.0
3         104  Priya    Finance   28  52000.0
1         102   Neha         HR   30  55000.0
2         103  Rahul         IT   35  60000.0
4         105  Karan         HR   40      NaN

In [26]:
df1.groupby("Department")["Salary"].sum()

Department
Finance     52000.0
HR          55000.0
IT         105000.0
Name: Salary, dtype: float64

In [27]:
df1["Bonus"] = df1["Salary"] * 0.10
df1

   EmployeeID   Name Department  Age   Salary   Bonus
0         101   Amit         IT   25  45000.0  4500.0
1         102   Neha         HR   30  55000.0  5500.0
2         103  Rahul         IT   35  60000.0  6000.0
3         104  Priya    Finance   28  52000.0  5200.0
4         105  Karan         HR   40      NaN     NaN

In [28]:
df1["Salary"] = df1["Salary"].fillna(df1["Salary"].mean())
df1

   EmployeeID   Name Department  Age   Salary   Bonus
0         101   Amit         IT   25  45000.0  4500.0
1         102   Neha         HR   30  55000.0  5500.0
2         103  Rahul         IT   35  60000.0  6000.0
3         104  Priya    Finance   28  52000.0  5200.0
4         105  Karan         HR   40  53000.0     NaN

In [29]:
df1.rename(columns={"EmployeeID": "ID"}, inplace=True)
df1

    ID   Name Department  Age   Salary   Bonus
0  101   Amit         IT   25  45000.0  4500.0
1  102   Neha         HR   30  55000.0  5500.0
2  103  Rahul         IT   35  60000.0  6000.0
3  104  Priya    Finance   28  52000.0  5200.0
4  105  Karan         HR   40  53000.0     NaN